package lesson4;

public class Main1 {
    public static void main(String[] args) {
        String[][] mas= {{"Турция","60","3 звезды","Самолет","3 раза"},
                {"Турция","70","4 звезды","Самолет","3 раза"},
                {"Турция","100","5 звезды","Самолет","3 раза"},
                {"Египет","50","3 звезды","Самолет","3 раза"},
                {"Дагестан","60","4 звезды","Поезд","3 раза"},
                {"Германия","100","5 звезды","Автобус","3 раза"}};
        Ture.getCountry(mas,"Турция");
        Ture t = new Ture();
        System.out.println();
        Ture.getCountry(mas,"Турция",65);
        Ture.getCountry(mas,"Турция",80,60);
    }

}
